test/load_banner.txt
This is ApacheBench, Version 2.3 <$Revision: 1879490 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient)


Server Software:        
Server Hostname:        localhost
Server Port:            8080

Document Path:          /banner
Document Length:        18668 bytes

Concurrency Level:      100
Time taken for tests:   1.033 seconds
Complete requests:      1000
Failed requests:        0
Total transferred:      18765000 bytes
HTML transferred:       18668000 bytes
Requests per second:    968.33 [#/sec] (mean)
Time per request:       103.270 [ms] (mean)
Time per request:       1.033 [ms] (mean, across all concurrent requests)
Transfer rate:          17744.87 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    2   4.0      1      41
Processing:    28   94  34.7     84     289
Waiting:       11   92  33.9     82     199
Total:         34   96  33.5     85     290

Percentage of the requests served within a certain time (ms)
  50%     85
  66%     93
  75%    105
  80%    114
  90%    156
  95%    170
  98%    183
  99%    194
 100%    290 (longest request)