test/load_user_banner_cached.txt
This is ApacheBench, Version 2.3 <$Revision: 1879490 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient)


Server Software:        
Server Hostname:        localhost
Server Port:            8080

Document Path:          /user_banner?tag_id=&feature_id=&use_last_revision=false
Document Length:        0 bytes

Concurrency Level:      100
Time taken for tests:   0.369 seconds
Complete requests:      1000
Failed requests:        0
Non-2xx responses:      1000
Total transferred:      84000 bytes
HTML transferred:       0 bytes
Requests per second:    2711.07 [#/sec] (mean)
Time per request:       36.886 [ms] (mean)
Time per request:       0.369 [ms] (mean, across all concurrent requests)
Transfer rate:          222.39 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0   11   5.4     12      24
Processing:     5   24   7.8     22      52
Waiting:        2   22   6.8     21      40
Total:          9   35   8.7     35      59

Percentage of the requests served within a certain time (ms)
  50%     35
  66%     40
  75%     42
  80%     43
  90%     46
  95%     49
  98%     53
  99%     54
 100%     59 (longest request)